import { IProjectResultsReport } from "../../../../../../domain/entities/proj/projectResultsReport";

let deliveryNoteSchemas_page: any = {
  page_1: {
    "ใบนำส่ง1": {
      "type": "text",
      "position": {
        "x": 18.96,
        "y": 20.21
      },
      "width": 172.74,
      "height": 12.83,
      "fontName": "Bold",
      "alignment": "center",
      "fontSize": 14
    },
    "ชื่อองค์การ1": {
      "type": "text",
      "position": {
        "x": 18.96,
        "y": 45.5
      },
      "width": 170.89,
      "height": 9.67,
      "fontName": "Regular",
      "fontSize": 12,
      "alignment": "left"
    },
    "เนื้อหา1": {
      "type": "text",
      "position": {
        "x": 18.96,
        "y": 94.3
      },
      "width": 170.89,
      "height": 147.41,
      "fontName": "Regular",
      "fontSize": 12
    },
    "วันที่1": {
      "type": "text",
      "position": {
        "x": 112.38,
        "y": 55.83
      },
      "width": 76.53,
      "height": 10.44,
      "alignment": "center",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "เรื่อง1": {
      "type": "text",
      "position": {
        "x": 18.96,
        "y": 70.11
      },
      "width": 170.89,
      "height": 7.53,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "เรียน1": {
      "type": "text",
      "position": {
        "x": 18.96,
        "y": 79.9
      },
      "width": 170.89,
      "height": 8.58,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "ที่ปรึกษา1": {
      "type": "text",
      "position": {
        "x": 18.96,
        "y": 240.74
      },
      "width": 83.13,
      "height": 24.71,
      "alignment": "center",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "ผู้รับผิดชอบ1": {
      "type": "text",
      "position": {
        "x": 110.45,
        "y": 240.74
      },
      "width": 83.13,
      "height": 24.71,
      "alignment": "center",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
  },
  page_2: {
    "ลงชื่อสโมสรคณะ1": {
      "type": "text",
      "position": {
        "x": 71.33,
        "y": 59
      },
      "width": 117.79,
      "height": 16.21,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "ความเห็นของสโมสรนิสิตคณะ1": {
      "type": "text",
      "position": {
        "x": 18.91,
        "y": 19.69
      },
      "width": 171.26,
      "height": 34.23,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "ลงชื่อองค์การ1": {
      "type": "text",
      "position": {
        "x": 72.07,
        "y": 187
      },
      "width": 117.79,
      "height": 16.21,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "ความเห็นขององค์การ1": {
      "type": "text",
      "position": {
        "x": 19.07,
        "y": 147.69
      },
      "width": 171.26,
      "height": 34.23,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "ลงชื่อที่ปรึกษา1": {
      "type": "text",
      "position": {
        "x": 72.23,
        "y": 122.66
      },
      "width": 117.79,
      "height": 16.21,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "ความเห็นของที่ปรึกษา1": {
      "type": "text",
      "position": {
        "x": 18.54,
        "y": 82.82
      },
      "width": 171.26,
      "height": 34.23,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "ลงชื่อสภา1": {
      "type": "text",
      "position": {
        "x": 71.96,
        "y": 253.36
      },
      "width": 117.79,
      "height": 16.21,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "ความเห็นของสภา1": {
      "type": "text",
      "position": {
        "x": 17.96,
        "y": 213.78
      },
      "width": 171.26,
      "height": 34.23,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    }
  },
  page_3: {
    "ความเห็นของฝ่ายกิจการ1": {
      "type": "text",
      "position": {
        "x": 18.91,
        "y": 19.69
      },
      "width": 171.26,
      "height": 34.23,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "ลงชื่อฝ่ายกิจการ1": {
      "type": "text",
      "position": {
        "x": 71.33,
        "y": 59
      },
      "width": 118.05,
      "height": 16.21,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "ความเห็นของสำนักงาน1": {
      "type": "text",
      "position": {
        "x": 19.07,
        "y": 84.26
      },
      "width": 171.26,
      "height": 34.23,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "ลงชื่อสำนักงาน1": {
      "type": "text",
      "position": {
        "x": 71.48,
        "y": 123.57
      },
      "width": 118.58,
      "height": 16.21,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "ความเห็นของรอง_ผู้ช่วยคณบดี1": {
      "type": "text",
      "position": {
        "x": 19.01,
        "y": 149.41
      },
      "width": 171.26,
      "height": 34.23,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "ลงชื่อรอง_ผู้ช่วยคณบดี1": {
      "type": "text",
      "position": {
        "x": 71.43,
        "y": 188.71
      },
      "width": 118.05,
      "height": 16.21,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "บันทึกสั่งการของคณบดี1": {
      "type": "text",
      "position": {
        "x": 19.17,
        "y": 213.98
      },
      "width": 171.26,
      "height": 34.23,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "ลงชื่อบันทึกสั่งการของคณบดี1": {
      "type": "text",
      "position": {
        "x": 71.58,
        "y": 253.29
      },
      "width": 118.58,
      "height": 16.21,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"

    }
  }
}
let projectSchemas_page_1: any = {
  page_1: {
    "แบบรายงานประเมิน": {
      "type": "text",
      "position": {
        "x": 15.14,
        "y": 18.89
      },
      "width": 182.37,
      "height": 9.91,
      "alignment": "center",
      "fontSize": 14,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Bold"
    },
    "ชื่อโครงการ": {
      "type": "text",
      "position": {
        "x": 17.92,
        "y": 32.73
      },
      "width": 173.1,
      "height": 8.32,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "ชื่อกลุ่มกิจกรรมนิสิต": {
      "type": "text",
      "position": {
        "x": 17.86,
        "y": 44.71
      },
      "width": 173.1,
      "height": 18.37,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "รายชื่อนิสิต": {
      "type": "text",
      "position": {
        "x": 18.06,
        "y": 67.28
      },
      "width": 173.1,
      "height": 36.09,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "รายชื่อที่ปรึกษา": {
      "type": "text",
      "position": {
        "x": 18.01,
        "y": 107.38
      },
      "width": 173.1,
      "height": 26.3,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "สถานที่": {
      "type": "text",
      "position": {
        "x": 17.86,
        "y": 137.98
      },
      "width": 173.1,
      "height": 19.69,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "ระยะเวลา": {
      "type": "text",
      "position": {
        "x": 18.07,
        "y": 162.53
      },
      "width": 173.1,
      "height": 19.69,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "จำนวนผู้เข้าร่วม": {
      "type": "text",
      "position": {
        "x": 18.01,
        "y": 187.09
      },
      "width": 173.1,
      "height": 43.76,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "จำนวนผู้เข้าจริง": {
      "type": "text",
      "position": {
        "x": 17.95,
        "y": 235.45
      },
      "width": 173.1,
      "height": 43.76,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    }
  },
  page_2: {
    "การบรรลุวัตถุประสงค์": {
      "type": "text",
      "position": {
        "x": 17.99,
        "y": 18.95
      },
      "width": 88.97,
      "height": 8.58,
      "alignment": "center",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "ตาราง 9": {
      "type": "text",
      "position": {
        "x": 14.55,
        "y": 31.75
      },
      "width": 184.22,
      "height": 79.75,
      "alignment": "center",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Bold"
    },
    "ลำดับที่": {
      "type": "text",
      "position": {
        "x": 14.55,
        "y": 31.81
      },
      "width": 17.78,
      "height": 79.49,
      "alignment": "center",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "วัตถุประสงค์โครงการ": {
      "type": "text",
      "position": {
        "x": 32.78,
        "y": 31.74
      },
      "width": 60.65,
      "height": 79.75,
      "alignment": "center",
      "fontSize": 12,
      "characterSpacing": 0.1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "ระดับ": {
      "type": "text",
      "position": {
        "x": 93.92,
        "y": 32.07
      },
      "width": 104.84,
      "height": 9.36,
      "alignment": "center",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular",
      "verticalAlignment": "middle"
    },
    "มากที่สุด": {
      "type": "text",
      "position": {
        "x": 93.97,
        "y": 41.75
      },
      "width": 20.96,
      "height": 69.44,
      "alignment": "center",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "มาก": {
      "type": "text",
      "position": {
        "x": 114.93,
        "y": 41.81
      },
      "width": 20.96,
      "height": 69.7,
      "alignment": "center",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "ปานกลาง": {
      "type": "text",
      "position": {
        "x": 135.59,
        "y": 41.81
      },
      "width": 20.96,
      "height": 69.7,
      "alignment": "center",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "น้อย": {
      "type": "text",
      "position": {
        "x": 156.18,
        "y": 41.81
      },
      "width": 20.96,
      "height": 69.7,
      "alignment": "center",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "น้อยที่สุด": {
      "type": "text",
      "position": {
        "x": 177.47,
        "y": 41.81
      },
      "width": 20.96,
      "height": 69.44,
      "alignment": "center",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    " วัตถุประสงค์ 9.1": {
      "type": "text",
      "position": {
        "x": 33.19,
        "y": 59.43
      },
      "width": 165.61,
      "height": 11.21,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular",
      "verticalAlignment": "middle"
    },
    " วัตถุประสงค์ 9.2": {
      "type": "text",
      "position": {
        "x": 32.8,
        "y": 68.77
      },
      "width": 165.61,
      "height": 11.21,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular",
      "verticalAlignment": "middle"
    },
    " วัตถุประสงค์ 9.3": {
      "type": "text",
      "position": {
        "x": 32.89,
        "y": 78.44
      },
      "width": 165.61,
      "height": 11.21,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular",
      "verticalAlignment": "middle"
    },
    " วัตถุประสงค์ 9.5": {
      "type": "text",
      "position": {
        "x": 32.75,
        "y": 99.01
      },
      "width": 165.61,
      "height": 12.27,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular",
      "verticalAlignment": "middle"
    },
    " วัตถุประสงค์ 9.4": {
      "type": "text",
      "position": {
        "x": 32.75,
        "y": 88.65
      },
      "width": 165.61,
      "height": 11.21,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular",
      "verticalAlignment": "middle"
    },
    "10/11/12/13": {
      "type": "text",
      "position": {
        "x": 16.92,
        "y": 119.77
      },
      "width": 181.31,
      "height": 154.88,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular",
      "verticalAlignment": "middle"
    }
  },
  page_3: {
    "งบประมาณ": {
      "type": "text",
      "position": {
        "x": 20,
        "y": 20
      },
      "width": 103.53,
      "height": 7,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular",
      "verticalAlignment": "middle"
    },
    "ตาราง 14": {
      "type": "text",
      "position": {
        "x": 20.38,
        "y": 32.28
      },
      "width": 169.14,
      "height": 103.04,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Bold",
      "verticalAlignment": "middle"
    },
    "รายการ": {
      "type": "text",
      "position": {
        "x": 19.89,
        "y": 32.2
      },
      "width": 75.48,
      "height": 103.04,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "การอนุมัติ": {
      "type": "text",
      "position": {
        "x": 95.51,
        "y": 32.01
      },
      "width": 93.73,
      "height": 15.73,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular",
      "verticalAlignment": "middle"
    },
    "ได้รับอนุมัติ": {
      "type": "text",
      "position": {
        "x": 95.51,
        "y": 47.89
      },
      "width": 31.29,
      "height": 87.43,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "จ่ายจริง": {
      "type": "text",
      "position": {
        "x": 127.42,
        "y": 48.04
      },
      "width": 31.82,
      "height": 87.43,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "คงเหลือ": {
      "type": "text",
      "position": {
        "x": 159.49,
        "y": 47.84
      },
      "width": 29.7,
      "height": 87.43,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "รวมค่าใช้จ่าย": {
      "type": "text",
      "position": {
        "x": 19.94,
        "y": 141.88
      },
      "width": 169.4,
      "height": 76.32,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular",
      "verticalAlignment": "middle"
    },
    "ลงชื่อที่ปรึกษา": {
      "type": "text",
      "position": {
        "x": 19.89,
        "y": 240.18
      },
      "width": 83.94,
      "height": 30.28,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    },
    "ลงชื่อผู้รับผิดชอบ": {
      "type": "text",
      "position": {
        "x": 110.85,
        "y": 239.86
      },
      "width": 77.33,
      "height": 30.28,
      "alignment": "left",
      "fontSize": 12,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    }
  },
  page_4:     {
    "สรุปรายงานผล": {
      "type": "text",
      "position": {
        "x": 20,
        "y": 20
      },
      "width": 167.82,
      "height": 15.2,
      "alignment": "left",
      "fontSize": 14,
      "characterSpacing": 1,
      "lineHeight": 1,
      "fontName": "Regular"
    }
  }
}




let projectReportSchemas: any = {
  ...deliveryNoteSchemas_page.page_1,
  ...deliveryNoteSchemas_page.page_2,
  ...deliveryNoteSchemas_page.page_3,
  ...projectSchemas_page_1.page_1,
  ...projectSchemas_page_1.page_2,
  ...projectSchemas_page_1.page_3,
  ...projectSchemas_page_1.page_4
}
let deliveryNote = [
  {
    "ใบนำส่ง1": "ใบนำส่งรายงานประเมินผลโครงการกิจกรรมนิสิตที่ขอใช้เงินค่าบำรุงกิจกรรม/กีฬา (สำหรับสโมสรนิสิตคณะ)",
    "ชื่อองค์การ1": "ที่............../..........\t                                                      (ชื่อองค์กรนิสิต)..............................................",
    "เนื้อหา1": "สิ่งที่ส่งมาด้วย\t1. รายงานประเมินผลโครงการ\t\t                \tจำนวน\t\t1\tชุด\n\t\t                  2. ภาพถ่ายการปฏิบัติงาน\t\t\t                        จำนวน\t\t\tภาพ\n\t\t                  3. แบบสรุปผลการดำเนินงานตามโครงการ\t \tจำนวน\t\t1\tชุด\n\t\t                \n\t\t\t\t\t\tตามที่(ชื่อองค์กรนิสิต)....................................................................................ได้รับอนุมัติ ให้จัดโครงการ...................................................................................วันที่............................................. ณ................................................................................................................................โดยมีวัตถุประสงค์ เพื่อ(โดยสังเขป)................................................................................................................................................................................................................................................................................................นั้น   \n\t\t                        \n\t\t\t\t\t\tในการนี้(ชื่อองค์กรนิสิต).........................................................................................จึงขอ รายงานประเมินผลโครงการ..........................................................................................รายละเอียดตามเอกสารที่ส่งมาด้วย\n\n\n                        จึงเรียนมาเพื่อโปรดทราบ",
    "วันที่1": "วันที่.........................................",
    "เรื่อง1": "เรื่อง\tรายงานประเมินผลโครงการ.......................................................",
    "เรียน1": "เรียน\tคณบดี..................................................................",
    "ที่ปรึกษา1": " (ลงชื่อ)............................................\n\n  (............................................)\n\tที่ปรึกษาโครงการ",
    "ผู้รับผิดชอบ1": " (ลงชื่อ)............................................\n\n  (............................................)\nผู้รับผิดชอบโครงการ"
  },
  {
    "ลงชื่อสโมสรคณะ1": "(ลงชื่อ)............................................ ....../....../......\n \t          \t\t\t \n           (.........................................)",
    "ความเห็นของสโมสรนิสิตคณะ1": "1. ความเห็นของสโมสรนิสิตคณะ\n\n............................................................................................................................................................................................................................................................................................................................................................................................................................................",
    "ลงชื่อองค์การ1": "(ลงชื่อ)............................................ ....../....../......\n \t          \t\t\t \n           (.........................................)",
    "ความเห็นขององค์การ1": "3. ความเห็นขององค์การนิสิต\n\n............................................................................................................................................................................................................................................................................................................................................................................................................................................",
    "ลงชื่อที่ปรึกษา1": "(ลงชื่อ)............................................ ....../....../......\n \t          \t\t\t \n           (.........................................)",
    "ความเห็นของที่ปรึกษา1": "2. ความเห็นของที่ปรึกษาสโมสรนิสิต\n\n............................................................................................................................................................................................................................................................................................................................................................................................................................................",
    "ลงชื่อสภา1": "(ลงชื่อ)............................................ ....../....../......\n \t          \t\t\t \n           (.........................................)",
    "ความเห็นของสภา1": "4. ความเห็นของสภานิสิต\n\n\t\tตรวจสอบแล้วเอกสารหลักฐานถูกต้องครบถ้วน    ใช้เงินจำนวน...................บาท\n....................................................................................................................................................................................................................."
  },
  {
    "ความเห็นของฝ่ายกิจการ1": "5. ความเห็นของฝ่ายกิจการนิสิตวิทยาเขตพัทลุง\n\n\t [ ] รับทราบ\n.................................................................................................................................................................................................................................................................................................................................\n",
    "ลงชื่อฝ่ายกิจการ1": "(ลงชื่อ)................................. ....../....../......               \t   \n          (................................)",
    "ความเห็นของสำนักงาน1": "6. ความเห็นของสำนักงานคณะ\n\n............................................................................................................................................................................................................................................................................................................................................................................................................................................",
    "ลงชื่อสำนักงาน1": "(ลงชื่อ)................................. ....../....../......               \t   \n          (................................)",
    "ความเห็นของรอง_ผู้ช่วยคณบดี1": "7. ความเห็นของรองคณบดี/ผู้ช่วยคณบดี\n\n............................................................................................................................................................................................................................................................................................................................................................................................................................................",
    "ลงชื่อรอง_ผู้ช่วยคณบดี1": "(ลงชื่อ)................................. ....../....../......               \t   \n          (................................)",
    "บันทึกสั่งการของคณบดี1": "8. บันทึกสั่งการของคณบดี\n\n............................................................................................................................................................................................................................................................................................................................................................................................................................................",
    "ลงชื่อบันทึกสั่งการของคณบดี1": "(ลงชื่อ)................................. ....../....../......               \t   \n          (................................)"
  }
]
let projectReportInputs = [
  {
    "แบบรายงานประเมิน": "แบบรายงานประเมินผลโครงการกิจกรรมนิสิต (สำหรับสโมสรนิสิตคณะ)",
    "ชื่อโครงการ": "1.ชื่อโครงการ........................................................................................",
    "ชื่อกลุ่มกิจกรรมนิสิต": "2.ชื่อกลุ่มกิจกรรมนิสิตที่รับผิดชอบโครงการ\n\n............................................................................................................",
    "รายชื่อนิสิต": "3.รายชื่อนิสิตผู้รับผิดชอบโครงการ\n\n\t 3.1................................................... รหัสประจำตัวนิสิต......................\n         หมายเลขโทรศัพท์……………..............\n     3.2................................................... รหัสประจำตัวนิสิต......................\n         หมายเลขโทรศัพท์……………..............",
    "รายชื่อที่ปรึกษา": "4.รายชื่อที่ปรึกษาโครงการ\n\n\t 4.1................................................... หมายเลขโทรศัพท์…………….........\n     4.2................................................... หมายเลขโทรศัพท์…………….........",
    "สถานที่": "5.สถานที่ปฏิบัติงาน\n\n............................................................................................................",
    "ระยะเวลา": "6.ระยะเวลาการปฏิบัติงาน\n\n............................................................................................................",
    "จำนวนผู้เข้าร่วม": "7.จำนวนผู้เข้าร่วมโครงการที่ได้รับอนุมัติ\n\n    7.1 ที่ปรึกษา\t   ชาย............คน       หญิง..............คน     รวม.............คน\n\t7.2 นิสิต\t\t\t ชาย............คน       หญิง..............คน     รวม.............คน\n    7.3 อาจารย์  \t  ชาย............คน       หญิง..............คน     รวม.............คน\n\t7.4 อื่นๆ(.....)     ชาย............คน       หญิง..............คน     รวม.............คน\n\n                                                                                       รวม.............คน\n",
    "จำนวนผู้เข้าจริง": "8. จำนวนผู้เข้าร่วมโครงการจริง\n\n    8.1 ที่ปรึกษา\t   ชาย............คน       หญิง..............คน     รวม.............คน\n\t8.2 นิสิต\t\t\t ชาย............คน       หญิง..............คน     รวม.............คน\n    8.3 อาจารย์  \t  ชาย............คน       หญิง..............คน     รวม.............คน\n\t8.4 อื่นๆ(.....)     ชาย............คน       หญิง..............คน     รวม.............คน\n\n                                                                                       รวม.............คน\n\","
  },
  {
    "การบรรลุวัตถุประสงค์": "9.การบรรลุวัตถุประสงค์ของโครงการ",
    "ตาราง 9": "",
    "ลำดับที่": "\n\nลำดับที่\n\n\n\n9.1\n\n9.2\n\n9.3\n\n9.4\n\n9.5",
    "วัตถุประสงค์โครงการ": "\n\nวัตถุประสงค์โครงการ",
    "ระดับ": "ระดับการบรรลุวัตถุประสงค์",
    "มากที่สุด": "มากที่สุด",
    "มาก": "มาก",
    "ปานกลาง": "ปานกลาง",
    "น้อย": "น้อย",
    "น้อยที่สุด": "น้อยที่สุด",
    " วัตถุประสงค์ 9.1": " วัตถุประสงค์ 9.1",
    " วัตถุประสงค์ 9.2": " วัตถุประสงค์ 9.2",
    " วัตถุประสงค์ 9.3": " วัตถุประสงค์ 9.3",
    " วัตถุประสงค์ 9.5": " วัตถุประสงค์ 9.5",
    " วัตถุประสงค์ 9.4": " วัตถุประสงค์ 9.4",
    "10/11/12/13": "10.การบรรลุเป้าหมายโครงการ\n\n\t      ด้านปริมาณ\n     \n     10.1…………………………………......................................................................\n\n\t 10.2………………………………………..................…............................................\n \n        ด้านคุณภาพ\n\n\t  10.3……………………....…………...................................................................\n\n      10.4………………………………………................................................................\n\n\n11.ปัญหาในการปฏิบัติงาน\n\n     11.1.....................................................................................................\n     11.2.....................................................................................................\n\n\n12.ข้อเสนอแนะแนวทางการแก้ปัญหาแต่ละปัญหา\n\n\t  12.1.....................................................................................................\n      12.2.....................................................................................................\n\n\n13. ผลที่ได้รับในเชิงพัฒนานิสิต\n\t  13.1.....................................................................................................\n\t  13.2.....................................................................................................\n      13.3....................................................................................................."
  },
  {
    "งบประมาณ": "14. งบประมาณค่าใช้จ่ายจริงตามรายการดังนี้",
    "ตาราง 14": "",
    "รายการ": "\n              รายการ\n\n\n14.1 หมวดค่าใช้สอย\n\n        14.1.1       \n\n14.2 หมวดค่าตอบแทน\n\n        14.2.1       \n\n14.3 หมวดค่าวัสดุอุปกรณ์\n\n        14.3.1       \n\n14.4 ค่าอื่น ๆ\n\n\n                  รวม\n",
    "การอนุมัติ": "  ได้รับอนุมัติ\t    จ่ายจริง\t    คงเหลือ",
    "ได้รับอนุมัติ": "\n\n\n     14.1.1\n\n\n\n     14.2.1\n\n\n\n     14.3.1",
    "จ่ายจริง": "\n\n\n     14.1.1\n\n\n\n     14.2.1\n\n\n\n     14.3.1",
    "คงเหลือ": "\n\n\n     14.1.1\n\n\n\n     14.2.1\n\n\n\n     14.3.1",
    "รวมค่าใช้จ่าย": "รวมค่าใช้จ่ายทั้งสิ้น\t                               เป็นเงิน............................บาท \n\n                                                             (............................................)\t\n\t\nงบประมาณที่ได้รับอนุมัติตามโครงการ \t      เป็นเงิน.............................บาท \n\n                                                             (............................................)\n\nเงินเหลือจ่ายต้องคืนมหาวิทยาลัย\t\t         เป็นเงิน.............................บาท\n\n                                                             (............................................)\n\nผู้รับเงินคืน..........................................                ....../....../......\n\n                                                            (กรณีมีเงินเหลือจ่ายจากโครงการ)",
    "ลงชื่อที่ปรึกษา": "(ลงชื่อ)..........................................\n\n   \t  (..........................................)\n\n             \tที่ปรึกษาโครงการ",
    "ลงชื่อผู้รับผิดชอบ": "(ลงชื่อ).....................................\n\n   \t (......................................)\n\n           \tผู้รับผิดชอบโครงการ   "
  },
  {
    "สรุปรายงานผล": " 15.สรุปรายงานผลการดำเนินกิจกรรมต่างๆในโครงการพร้อมภาพประกอบการบรรยายหรือเอกสารแนบ"
  }
]
function projectReportData(proj: IProjectResultsReport){
  let inputs:any = [];
  deliveryNote.map((item:any) => inputs.push(item))
  projectReportInputs.map((item:any) => inputs.push(item));
  return inputs
}



export { projectReportData, projectReportSchemas }
